## Pandas Data Structures

In [13]:
import numpy as np
import pandas as pd

### Creating a series

In [4]:
labels = ['A','B','C']
list_1 = ['a','b','c']
list_2 = ['*','*','*']
num    = [20,30,40]
dict_1 = {'a':20,'b':30, 'c':40}
arr1   = np.array(['Kenan','Alaa','Fouad'])

In [5]:
ser_1 = pd.Series(list_1)
ser_1

0    a
1    b
2    c
dtype: object

In [6]:
ser2 = pd.Series(dict_1)
ser2

a    20
b    30
c    40
dtype: int64

In [7]:
ser3 = pd.Series(arr1)
ser3

0    Kenan
1     Alaa
2    Fouad
dtype: object

In [8]:
ser5 = pd.Series(arr1,labels)
ser5

A    Kenan
B     Alaa
C    Fouad
dtype: object

In [9]:
ser6 = pd.Series(arr1,list_2)
ser6

*    Kenan
*     Alaa
*    Fouad
dtype: object

In [10]:
ser7 = pd.Series(num)
ser7

0    20
1    30
2    40
dtype: int64

In [11]:
ser8 = pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])
ser8

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser8['Japan']

4

In [13]:
ser8.iloc[0]

1

In [14]:
ser9 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])    
ser9

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser_add = ser8 + ser9
ser_add

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrame

In [1]:
from numpy.random import randn
np.random.seed(42) # mit seed gibt random die selben nummern bei allen
data1 = np.random.randint(1,10,(5,4))
data = randn(5,4)
data

NameError: name 'np' is not defined

In [18]:
df = pd.DataFrame(data,index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.462378  1.538715 -2.439106  0.603441
B -0.251044 -0.163867 -1.476330  1.486981
C -0.024455  0.355551  0.417011  0.832462
D -0.293399 -0.029839  0.095126  0.664654
E -0.140218 -0.033193 -0.749077 -0.778382

In [19]:
df['X']

A    1.538715
B   -0.163867
C    0.355551
D   -0.029839
E   -0.033193
Name: X, dtype: float64

In [20]:
df['X']['A']

1.538714967614598

In [21]:
df[['X','W']]

          X         W
A  1.538715  1.462378
B -0.163867 -0.251044
C  0.355551 -0.024455
D -0.029839 -0.293399
E -0.033193 -0.140218

In [22]:
df[['X','W','Z']]

          X         W         Z
A  1.538715  1.462378  0.603441
B -0.163867 -0.251044  1.486981
C  0.355551 -0.024455  0.832462
D -0.029839 -0.293399  0.664654
E -0.033193 -0.140218 -0.778382

In [23]:
# rows finden
df.loc['B']

W   -0.251044
X   -0.163867
Y   -1.476330
Z    1.486981
Name: B, dtype: float64

In [24]:
# 2 rows
df.loc[['B','C']]

          W         X         Y         Z
B -0.251044 -0.163867 -1.476330  1.486981
C -0.024455  0.355551  0.417011  0.832462

In [3]:
# rows finden mit index eingeben
df.iloc[[0,2]]

NameError: name 'df' is not defined

In [26]:
# add new culomn
df['new'] = df['X']+df['Z']
df

          W         X         Y         Z       new
A  1.462378  1.538715 -2.439106  0.603441  2.142156
B -0.251044 -0.163867 -1.476330  1.486981  1.323114
C -0.024455  0.355551  0.417011  0.832462  1.188013
D -0.293399 -0.029839  0.095126  0.664654  0.634816
E -0.140218 -0.033193 -0.749077 -0.778382 -0.811575

In [27]:
# remov column without inplace=True
df.drop('X',axis=1)
df

          W         X         Y         Z       new
A  1.462378  1.538715 -2.439106  0.603441  2.142156
B -0.251044 -0.163867 -1.476330  1.486981  1.323114
C -0.024455  0.355551  0.417011  0.832462  1.188013
D -0.293399 -0.029839  0.095126  0.664654  0.634816
E -0.140218 -0.033193 -0.749077 -0.778382 -0.811575

In [28]:
# remov column with inplace=True
# axis=1 ganz column
df.drop('X',axis=1,inplace=True)
df

          W         Y         Z       new
A  1.462378 -2.439106  0.603441  2.142156
B -0.251044 -1.476330  1.486981  1.323114
C -0.024455  0.417011  0.832462  1.188013
D -0.293399  0.095126  0.664654  0.634816
E -0.140218 -0.749077 -0.778382 -0.811575

In [29]:
df

          W         Y         Z       new
A  1.462378 -2.439106  0.603441  2.142156
B -0.251044 -1.476330  1.486981  1.323114
C -0.024455  0.417011  0.832462  1.188013
D -0.293399  0.095126  0.664654  0.634816
E -0.140218 -0.749077 -0.778382 -0.811575

In [9]:
#df.loc[[row,culomn]]
df.loc[['B','C'],['Y','Z']]

NameError: name 'df' is not defined

In [31]:
df>0

       W      Y      Z    new
A   True  False   True   True
B  False  False   True   True
C  False   True   True   True
D  False   True   True   True
E  False  False  False  False

In [32]:
ser11 = df[df>0]
ser11

          W         Y         Z       new
A  1.462378       NaN  0.603441  2.142156
B       NaN       NaN  1.486981  1.323114
C       NaN  0.417011  0.832462  1.188013
D       NaN  0.095126  0.664654  0.634816
E       NaN       NaN       NaN       NaN

In [33]:
ser11.isna()

       W      Y      Z    new
A  False   True  False  False
B   True   True  False  False
C   True  False  False  False
D   True  False  False  False
E   True   True   True   True

In [7]:
# wie finde ich nan in der Tabelle
ser11.info()

NameError: name 'ser11' is not defined

In [5]:
df

NameError: name 'df' is not defined

In [36]:
df[df['new']>1]

          W         Y         Z       new
A  1.462378 -2.439106  0.603441  2.142156
B -0.251044 -1.476330  1.486981  1.323114
C -0.024455  0.417011  0.832462  1.188013

In [37]:
df[df['new']>1]['W']

A    1.462378
B   -0.251044
C   -0.024455
Name: W, dtype: float64

In [38]:
df[df['new']>1][['W','Y']]

          W         Y
A  1.462378 -2.439106
B -0.251044 -1.476330
C -0.024455  0.417011

In [39]:
# wenn ich zwei bedingungen habe
df[(df['W']>0)&(df['new']>1)]

          W         Y         Z       new
A  1.462378 -2.439106  0.603441  2.142156

In [40]:
# wenn ich mehrere bedingungen habe  (and &)
df[(df['W']>0)&(df['new']>1)&(df['Z']>0)]

          W         Y         Z       new
A  1.462378 -2.439106  0.603441  2.142156

In [41]:
# wenn ich mehrere bedingungen habe (or |)
df[(df['W']>0)&(df['new']>1)|(df['Z']>0)]

          W         Y         Z       new
A  1.462378 -2.439106  0.603441  2.142156
B -0.251044 -1.476330  1.486981  1.323114
C -0.024455  0.417011  0.832462  1.188013
D -0.293399  0.095126  0.664654  0.634816

### indexing

In [44]:
df.reset_index()

  index         W         Y         Z       new
0     A  1.462378 -2.439106  0.603441  2.142156
1     B -0.251044 -1.476330  1.486981  1.323114
2     C -0.024455  0.417011  0.832462  1.188013
3     D -0.293399  0.095126  0.664654  0.634816
4     E -0.140218 -0.749077 -0.778382 -0.811575

In [45]:
# mit split werden getrent
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [105]:
df['states'] = newind

In [107]:
# states als index
df.set_index('states')
df

               W         Y         Z       new states
states
CA      1.462378 -2.439106  0.603441  2.142156     CA
NY     -0.251044 -1.476330  1.486981  1.323114     NY
WY     -0.024455  0.417011  0.832462  1.188013     WY
OR     -0.293399  0.095126  0.664654  0.634816     OR
CO     -0.140218 -0.749077 -0.778382 -0.811575     CO

In [109]:
# states als index
df.set_index('states',inplace=True)
df

               W         Y         Z       new
states
CA      1.462378 -2.439106  0.603441  2.142156
NY     -0.251044 -1.476330  1.486981  1.323114
WY     -0.024455  0.417011  0.832462  1.188013
OR     -0.293399  0.095126  0.664654  0.634816
CO     -0.140218 -0.749077 -0.778382 -0.811575

## missing Data

In [15]:
dict1 = {'A':[1,2,np.nan],

                  'B':[5,np.nan,np.nan],

                  'C':[1,2,3]}

In [17]:
# dict1 to DataFrame
df1 = pd.DataFrame(dict1)
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [135]:
# wie kann ich wissen, wo nan sind
# 1:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       1 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 204.0 bytes

In [137]:
# wie kann ich wissen, wo nan sind
# 2:
df1.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [139]:
# wie kann ich wissen, wo nan sind
# 3:
df1.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [147]:
# alle rows mit Nan werden gelöcht
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [169]:
# die rows, die 2 values oder mehr haben werden gezeigt
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [179]:
# axis=1: alle columns, die NAN haben werden gelöcht
# axis=0: alle rows, die NAN haben werden gelöcht
df1.dropna(axis=1)

   C
0  1
1  2
2  3

In [185]:
# zweite Lösung, ein Values einzugeben
df1.fillna(value='fill_value')

            A           B  C
0         1.0         5.0  1
1         2.0  fill_value  2
2  fill_value  fill_value  3

In [187]:
# zweite Lösung, ein Values einzugeben
df1.fillna(value='20')

     A    B  C
0  1.0  5.0  1
1  2.0   20  2
2   20   20  3

In [189]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
#NAN in column A mit value von df1['A'].mean() einsetzen
df1['A'].fillna(df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [199]:
df1['B'].fillna(df1['B'].median())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [201]:
# wenn wir die Änderungen speichern möchten, müssen wir noch inplace=True hinzufügen
df1['B'].fillna(df1['B'].median(),inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_6040\1030904486.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['B'].fillna(df1['B'].median(),inplace=True)

## Groupby

In [210]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],

       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],

       'Sales':[200,120,340,124,243,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [214]:
df2 = pd.DataFrame(data)
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [306]:
df2.shape

(6, 3)

In [308]:
# erste 5 rows
df2.head

<bound method NDFrame.head of   Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350>

In [312]:
# letzte 5 rows
df2.tail

<bound method NDFrame.tail of   Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350>

In [316]:
# letzte 3 rows
df2.tail(3)

  Company   Person  Sales
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [216]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [266]:
# ich habe z.B 2 mal GOOG und 2 mal MSFT und 2 mal FB:  Anzeige:
by_comp = df2.groupby('Company')
by_comp
print(by_comp)


#ich hane for_loop benutzt, weil nur die Memory_Adresse von by_comp gezeigt wurde
for x,group in by_comp:
    print(f'Company_ name is {x}')
    print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000018C412D1880>
Company_ name is FB
  Company Person  Sales
4      FB   Carl    243
5      FB  Sarah    350
Company_ name is GOOG
  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
Company_ name is MSFT
  Company   Person  Sales
2    MSFT      Amy    340
3    MSFT  Vanessa    124

In [274]:
#wenn wir etwas berechnen möchten
#1:
by_comp=df2.groupby('Company')['Sales'].sum()
by_comp

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [276]:
#2:
by_comp=df2.groupby('Company')['Sales'].mean()
by_comp

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [272]:
# zeigt alle math operation für die columns die nummern haben
df2.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [296]:
# nur ein Teil vom Data bearbeiten
FB = df2[df2['Company']=='FB']
FB

  Company Person  Sales
4      FB   Carl    243
5      FB  Sarah    350

In [1]:
# math operation
FB['Sales'].count()
FB['Sales'].sum()

NameError: name 'FB' is not defined

In [294]:
# math op nur für FB
FB.describe()

            Sales
count    2.000000
mean   296.500000
std     75.660426
min    243.000000
25%    269.750000
50%    296.500000
75%    323.250000
max    350.000000

In [302]:
# nur ein Teil vom Data bearbeiten
GOOG = df2[df2['Company']=='GOOG']
GOOG

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120

In [304]:
GOOG.describe()

            Sales
count    2.000000
mean   160.000000
std     56.568542
min    120.000000
25%    140.000000
50%    160.000000
75%    180.000000
max    200.000000